# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Karsten\Desktop\IHA\3. Semester\Projekt\PHProbe\PHProbe.cydsn\PHProbe.cyprj
# Date: Fri, 15 May 2015 09:38:45 GMT
#set_units -time ns
create_clock -name {ADC_intClock(FFB)} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {ADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 3 7} [list]
create_generated_clock -name {Clock_1} -source [get_pins {ClockBlock/hfclk}] -edges {1 2400001 4800001} [list [get_pins {ClockBlock/udb_div_0}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Karsten\Desktop\IHA\3. Semester\Projekt\PHProbe\PHProbe.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Karsten\Desktop\IHA\3. Semester\Projekt\PHProbe\PHProbe.cydsn\PHProbe.cyprj
# Date: Fri, 15 May 2015 09:38:39 GMT
